# Class2 at MAKESCHOOL

In [78]:
import pandas as pd

df = pd.DataFrame(data= {'name':['john', 'mary', 'peter','jeff','bill', 'lisa'], 'age':[23, 78, 22, 19, 45, 33], 
                         'state': ['iowa', 'dc', 'california', 'texas', 'washington', 'dc'], 'num_children': [2, 2, 0, 1, 2, 1],
                        'num_pets' : [0, 4, 0, 5, 0, 0]})

In [79]:
df

   age   name  num_children  num_pets       state
0   23   john             2         0        iowa
1   78   mary             2         4          dc
2   22  peter             0         0  california
3   19   jeff             1         5       texas
4   45   bill             2         0  washington
5   33   lisa             1         0          dc

In [80]:
df.columns

Index(['age', 'name', 'num_children', 'num_pets', 'state'], dtype='object')

In [81]:
df.loc[2:4, 'name']

2    peter
3     jeff
4     bill
Name: name, dtype: object

In [82]:
df.loc[2:4, ["name", "age"]]

    name  age
2  peter   22
3   jeff   19
4   bill   45

In [83]:
# Select the first two rows
df.iloc[:2]

   age  name  num_children  num_pets state
0   23  john             2         0  iowa
1   78  mary             2         4    dc

In [84]:
# the last two ones
df.iloc[-2:]

   age  name  num_children  num_pets       state
4   45  bill             2         0  washington
5   33  lisa             1         0          dc

In [85]:
df.loc[:2]

   age   name  num_children  num_pets       state
0   23   john             2         0        iowa
1   78   mary             2         4          dc
2   22  peter             0         0  california

In [86]:
df.iloc[:,0]

0    23
1    78
2    22
3    19
4    45
5    33
Name: age, dtype: int64

In [87]:
df.loc[:,["age", "state"]]

   age       state
0   23        iowa
1   78          dc
2   22  california
3   19       texas
4   45  washington
5   33          dc

In [88]:
df.iloc[1]

age               78
name            mary
num_children       2
num_pets           4
state             dc
Name: 1, dtype: object

In [89]:
df[df["age"] > 30]

   age  name  num_children  num_pets       state
1   78  mary             2         4          dc
4   45  bill             2         0  washington
5   33  lisa             1         0          dc

In [90]:
df[df.age> 30]

   age  name  num_children  num_pets       state
1   78  mary             2         4          dc
4   45  bill             2         0  washington
5   33  lisa             1         0          dc

### Task: Select a dataframe such that the return dataframe has more pets than children

In [91]:
# Select people who have more pets
df[df["num_children"] < df["num_pets"]]

   age  name  num_children  num_pets  state
1   78  mary             2         4     dc
3   19  jeff             1         5  texas

In [92]:
df[(df["age"] > 40) | (df["num_pets"] > 0)]

   age  name  num_children  num_pets       state
1   78  mary             2         4          dc
3   19  jeff             1         5       texas
4   45  bill             2         0  washington

### Drop age and num_children columns

In [93]:
# It's not completely out,
#axis means column .... 
df.drop(["age", "num_children"], axis=1)

    name  num_pets       state
0   john         0        iowa
1   mary         4          dc
2  peter         0  california
3   jeff         5       texas
4   bill         0  washington
5   lisa         0          dc

In [94]:
df

   age   name  num_children  num_pets       state
0   23   john             2         0        iowa
1   78   mary             2         4          dc
2   22  peter             0         0  california
3   19   jeff             1         5       texas
4   45   bill             2         0  washington
5   33   lisa             1         0          dc

In [95]:
df.describe()

             age  num_children  num_pets
count   6.000000      6.000000  6.000000
mean   36.666667      1.333333  1.500000
std    22.384518      0.816497  2.345208
min    19.000000      0.000000  0.000000
25%    22.250000      1.000000  0.000000
50%    28.000000      1.500000  0.000000
75%    42.000000      2.000000  3.000000
max    78.000000      2.000000  5.000000

In [96]:
import numpy as np

df[["age","num_pets","num_children"]].apply(lambda col: np.mean(col),axis=0)

age             36.666667
num_pets         1.500000
num_children     1.333333
dtype: float64

In [97]:
# type(df["age"])
type(df[["age"]])

pandas.core.frame.DataFrame

In [98]:
df[["age"]]

   age
0   23
1   78
2   22
3   19
4   45
5   33

In [99]:
df[["age"]].apply(lambda value: value*2)

   age
0   46
1  156
2   44
3   38
4   90
5   66

In [112]:
# Return the whole df with the age values increased
df["age"] = df["age"].apply(lambda x: x/2)

In [113]:
df

     age   name  num_children  num_pets       state
0   46.0   john             2         0        iowa
1  156.0   mary             2         4          dc
2   44.0  peter             0         0  california
3   38.0   jeff             1         5       texas
4   90.0   bill             2         0  washington
5   66.0   lisa             1         0          dc

### Sort the dataframe based on age in ascending order

In [116]:
df

    age   name  num_children  num_pets       state
0  23.0   john             2         0        iowa
1  78.0   mary             2         4          dc
2  22.0  peter             0         0  california
3  19.0   jeff             1         5       texas
4  45.0   bill             2         0  washington
5  33.0   lisa             1         0          dc

In [122]:
df.sort_values("age", ascending = True)

    age   name  num_children  num_pets       state
3  19.0   jeff             1         5       texas
2  22.0  peter             0         0  california
0  23.0   john             2         0        iowa
5  33.0   lisa             1         0          dc
4  45.0   bill             2         0  washington
1  78.0   mary             2         4          dc

In [126]:
# String parsing
df[df["name"].apply(lambda x: x[0] == "j")]

    age  name  num_children  num_pets  state
0  23.0  john             2         0   iowa
3  19.0  jeff             1         5  texas

In [127]:
from collections import OrderedDict
from pandas import DataFrame
import pandas as pd
import numpy as np

table = OrderedDict((
    ("Item", ["Item0", "Item0", "Item1", "Item1"]),
    ("CType", ["Gold", "Bronze", "Gold", "Silver"]),
    ("USD", ["1$", "2$", "3$", "4$"]),
    ("EU", ["1$", "2$", "3$", "4$"])
))
d = DataFrame(table)

In [128]:
d

    Item   CType USD  EU
0  Item0    Gold  1$  1$
1  Item0  Bronze  2$  2$
2  Item1    Gold  3$  3$
3  Item1  Silver  4$  4$

In [129]:
p = d.pivot(index="Item", columns="CType", values="USD")

In [130]:
p

CType Bronze Gold Silver
Item
Item0     2$   1$   None
Item1   None   3$     4$